-------------------------------------------------------------------------------------------------------
-- Localizable strings (Simplified Chinese) ondh@二区·毁灭之锤 http://www.ondh.cn
-- Localizable strings (Simplified Chinese) 1.41UPDATE wangmarsfa@CWDG
if (GetLocale() == "zhCN") then

GEMHELPER_VERSION_TEXT		= "宝石助手 v1.5";
GEMHELPER_DONE_TEXT		= "完成";

GEMHELPER_ERRORTOOLTIP_L1	= "不安全的链接";
GEMHELPER_ERRORTOOLTIP_L2	= "ItemID: ";
GEMHELPER_ERRORTOOLTIP_L3	= "这个物品连接并不安全. 為了避免发生与服务器中断连接, 你需要曾经在游戏中看过这项物品. 這是暴雪公司自从1.10版本后所加入的限制.";
GEMHELPER_ERRORTOOLTIP_L4	= "你可以在不安全的链接上点击鼠标右键, 向服务器要求查看物品. 你可能与服务器中断连接!!";
GEMHELPER_QUERY_MESSAGE		= "服务器搜寻物品:  ";

GEMHELPER_OPENJC_TEXT		= "打开/关闭 系统默认珠宝加工技能窗口.";
GEMHELPER_CHANGEBGCOLOR_TEXT	= "改变背景颜色.";

-- GEMHELPER_JEWELCRAFTING_TEXT must match the text written on the top of default Jewelcrafting UI
-- window, which should also be the same as the text written in your Character --> Skills -->
-- Professions panel because this string is used to check whether a player has Jewelcrafting as
-- a profession as well as whether the Jewelcrafting default UI window is about to be open.
GEMHELPER_JEWELCRAFTING_TEXT	= "珠宝加工";

GEMHELPER_CHECKBUTTON_TEXT	= {
	[1]	= "用颜色过滤",
	[2]	= "用材料过滤",
	[3]	= "用属性过滤",

	[11]	= "蓝色(B)",
	[12]	= "红色(R)",
	[13]	= "黃色(Y)",
	[14]	= "多彩(Meta)",

	[21]	= "碧月石 (B)",
	[22]	= "血榴石 (R)",
	[23]	= "德拉诺金钻 (Y)",
	[24]	= "翠榄石 (Y/B)",
	[25]	= "火榴石 (Y/R)",
	[26]	= "德拉诺影钻 (R/B)",
	[27]	= "裂纹的珍珠 (R/B)",

	[31]	= "艾露恩之星 (B)",
	[32]	= "红曜石 (R)",
	[33]	= "黎明石 (Y)",
	[34]	= "水玉 (Y/B)",
	[35]	= "黄晶玉 (Y/R)",
	[36]	= "夜目石 (R/B)",
	[37]	= "暗影珍珠 (R/B)",

	[41]	= "天火钻石 (Meta)",
	[42]	= "大地风暴钻石 (Meta)",

	[51]	= "天蓝宝石 (B)",
	[52]	= "赤尖石 (R)",
	[53]	= "狮眼石 (Y)",
	[54]	= "海浪翡翠 (Y/B)",
	[55]	= "焚石 (Y/R)",
	[56]	= "影歌紫玉 (R/B)",

	[61]	= "力量",
	[62]	= "敏捷",
	[63]	= "耐力",
	[64]	= "智力",
	[65]	= "精神",
	[66]	= "韧性",

	[71]	= "命中等级",
	[72]	= "爆击等级",
	[73]	= "攻击强度",
	[74]	= "躲闪等级",
	[75]	= "防御等级",
	[76]	= "招架等级",

	[80]	= "法术命中等级",
	[81]	= "法术爆击等级",
	[82]	= "法术穿透",
	[83]	= "法术伤害",
	[84]	= "治疗法术",
	[85]	= "5秒回蓝",
	[86]	= "所有抗性",

	[101]	= "显示珠宝加工制作的宝石",
	[1011]	= "显示身上已有材料的",
	[1012]	= "可切割的角色: %s ",
	[102]	= "显示附魔制作的宝石",
	[103]	= "显示商人出售的宝石",
	[104]	= "显示副本掉落的宝石",

	[111]	= "取代系统加工界面",
};

-- Data for zhCN localization
GemHelper_GemLocaleData = {
	-- Crafted Uncommon Quality Gems
	[23095] = {["n"] = "朴素血榴石",		["d"] = "需要 1 血榴石"},
	[28595] = {["n"] = "明亮血榴石",		["d"] = "需要 1 血榴石"},
	[23113] = {["n"] = "闪耀德拉诺金钻",		["d"] = "需要 1 德拉诺金钻"},
	[23106] = {["n"] = "眩光翠榄石",		["d"] = "需要 1 翠榄石 (占星者)"},
	[23097] = {["n"] = "精致血榴石",		["d"] = "需要 1 血榴石"},
	[23105] = {["n"] = "坚硬翠榄石",		["d"] = "需要 1 翠榄石"},
	[23114] = {["n"] = "柔光德拉诺金钻",		["d"] = "需要 1 德拉诺金钻"},
	[23100] = {["n"] = "反光火榴石",		["d"] = "需要 1 火榴石"},
	[23108] = {["n"] = "炽热德拉诺影钻",		["d"] = "需要 1 德拉诺影钻"},
	[23098] = {["n"] = "铭文火榴石",		["d"] = "需要 1 火榴石"},
	[23104] = {["n"] = "裂纹翠榄石",		["d"] = "需要 1 翠榄石"},
	[23099] = {["n"] = "辉光火榴石",		["d"] = "需要 1 火榴石"},
	[23121] = {["n"] = "异彩碧月石",		["d"] = "需要 1 碧月石"},
	[23101] = {["n"] = "高能火榴石",		["d"] = "需要 1 火榴石"},
	[23103] = {["n"] = "辐光翠榄石",		["d"] = "需要 1 翠榄石"},
	[23116] = {["n"] = "刚硬德拉诺金钻",		["d"] = "需要 1 德拉诺金钻"},
	[23109] = {["n"] = "皇家德拉诺影钻",		["d"] = "需要 1 德拉诺影钻 (奥尔多)"},
	[23096] = {["n"] = "符文血榴石",		["d"] = "需要 1 血榴石"},
	[23110] = {["n"] = "狡诈德拉诺影钻",		["d"] = "需要 1 德拉诺影钻"},
	[28290] = {["n"] = "圆润德拉诺金钻",		["d"] = "需要 1 德拉诺金钻"},
	[23118] = {["n"] = "致密碧月石",		["d"] = "需要 1 碧月石"},
	[23111] = {["n"] = "统御德拉诺影钻",		["d"] = "需要 1 德拉诺影钻"},
	[23119] = {["n"] = "火花碧月石",		["d"] = "需要 1 碧月石"},
	[23120] = {["n"] = "风暴碧月石",		["d"] = "需要 1 碧月石"},
	[23094] = {["n"] = "泪珠血榴石",		["d"] = "需要 1 血榴石"},
	[23115] = {["n"] = "厚重德拉诺金钻",		["d"] = "需要 1 德拉诺金钻"},

	-- Crafted Rare Quality Gems
	[24027] = {["n"] = "朴素红曜石",		["d"] = "需要 1 红曜石"},
	[24031] = {["n"] = "明亮红曜石",		["d"] = "需要 1 红曜石"},
	[24047] = {["n"] = "闪耀黎明石",		["d"] = "需要 1 黎明石"},
	[24065] = {["n"] = "眩光水玉",			["d"] = "需要 1 水玉"},
	[24028] = {["n"] = "精致红曜石",		["d"] = "需要 1 红曜石"},
	[24062] = {["n"] = "坚硬水玉",			["d"] = "需要 1 水玉"},
	[24036] = {["n"] = "闪光红曜石",		["d"] = "需要 1 红曜石"},
	[24050] = {["n"] = "柔光黎明石",		["d"] = "需要 1 黎明石"},
	[24061] = {["n"] = "反光黄晶玉",		["d"] = "需要 1 黄晶玉"},
	[24056] = {["n"] = "炽热夜目石",		["d"] = "需要 1 夜目石"},
	[24058] = {["n"] = "铭文黄晶玉",		["d"] = "需要 1 黄晶玉"},
	[24067] = {["n"] = "裂纹水玉",			["d"] = "需要 1 水玉"},
	[24060] = {["n"] = "辉光黄晶玉",		["d"] = "需要 1 黄晶玉"},
	[24037] = {["n"] = "异彩艾露恩之星",		["d"] = "需要 1 艾露恩之星"},
	[24059] = {["n"] = "高能黄晶玉",		["d"] = "需要 1 黄晶玉"},
	[24066] = {["n"] = "辐光水玉",			["d"] = "需要 1 水玉"},
	[24051] = {["n"] = "刚硬黎明石",		["d"] = "需要 1 黎明石"},
	[24057] = {["n"] = "皇家夜目石",		["d"] = "需要 1 夜目石"},
	[24030] = {["n"] = "符文红曜石",		["d"] = "需要 1 红曜石"},
	[24055] = {["n"] = "狡诈夜目石",		["d"] = "需要 1 夜目石"},
	[24048] = {["n"] = "圆润黎明石",		["d"] = "需要 1 黎明石"},
	[24033] = {["n"] = "致密艾露恩之星",		["d"] = "需要 1 艾露恩之星"},
	[24054] = {["n"] = "统御夜目石",		["d"] = "需要 1 夜目石"},
	[24035] = {["n"] = "火花艾露恩之星",		["d"] = "需要 1 艾露恩之星"},
	[24039] = {["n"] = "风暴艾露恩之星",		["d"] = "需要 1 艾露恩之星"},
	[24032] = {["n"] = "诡秘红曜石",		["d"] = "需要 1 红曜石"},
	[24029] = {["n"] = "泪珠红曜石",		["d"] = "需要 1 红曜石"},
	[24052] = {["n"] = "厚重黎明石",		["d"] = "需要 1 黎明石"},

	-- Crafted Rare Meta Gems
	[25897] = {["n"] = "鼓舞之大地风暴钻石",	["d"] = "需要 1 大地风暴钻石"},
	[25899]	= {["n"] = "蛮力之大地风暴钻石",	["d"] = "需要 1 大地风暴钻石"},
	[25890] = {["n"] = "毁灭之天火钻石",		["d"] = "需要 1 天火钻石"},
	[25895] = {["n"] = "神秘之天火钻石",		["d"] = "需要 1 天火钻石"},
	[25901]	= {["n"] = "洞察之大地风暴钻石",	["d"] = "需要 1 大地风暴钻石"},
	[25893] = {["n"] = "秘法之天火钻石",		["d"] = "需要 1 天火钻石"},
	[25896] = {["n"] = "强能之大地风暴钻石",	["d"] = "需要 1 大地风暴钻石"},
	[25894] = {["n"] = "迅捷之天火钻石",		["d"] = "需要 1 天火钻石"},
	[25898]	= {["n"] = "坚韧之大地风暴钻石",	["d"] = "需要 1 大地风暴钻石"},

	-- Enchanter Created
	[22460] = {["n"] = "棱光之球",			["d"] = "附魔师, 需要 4 大块棱光碎片"},
	[22459] = {["n"] = "虚空之球",			["d"] = "附魔师, 需要 2 虚空水晶"},

	-- PvP Purchased Rare Meta Gems (Terrokar Spirit Towers)
	[28557] = {["n"] = "迅捷星火钻石",		["d"] = "商人, 8 幽魂碎片 (奥蕾莉亚要塞/裂石堡)"},
	[28556] = {["n"] = "迅捷风火钻石",		["d"] = "商人, 8 幽魂碎片 (奥蕾莉亚要塞/裂石堡)"},

	-- PvP Purchased Gems (Nagrand, Halaa)
	[27679]	= {["n"] = "卓越秘法黎明石",		["d"] = "商人, 100 哈兰作战勋章 (哈兰, 纳格兰)"},
	[30598] = {["n"] = "阿曼席欧先生的心形宝石", 	["d"] = "商人, 14g 9s 72c (限量) (哈兰, 纳格兰)"},

	-- PvP Purchased Epic Gems (Honor Points)
	[28362] = {["n"] = "朴素红绚石",		["d"] = "商人, 8100 荣誉 (勇士大厅/传说大厅)"},
	[28120] = {["n"] = "柔光精致黎明石",		["d"] = "商人, 8100 荣誉 (勇士大厅/传说大厅)"},
	[28363] = {["n"] = "雕文精致黄宝石",		["d"] = "商人, 10000 荣誉 (勇士大厅/传说大厅)"},
	[28123] = {["n"] = "高能精致黄宝石",		["d"] = "商人, 10000 荣誉 (勇士大厅/传说大厅)"},
	[28118] = {["n"] = "符文红绚石",		["d"] = "商人, 8100 荣誉 (勇士大厅/传说大厅)"},
	[28119] = {["n"] = "圆润精致黎明石",		["d"] = "商人, 8100 荣誉 (勇士大厅/传说大厅)"},

	-- PvP Puchased Rare Gems (Honor Hold/Thrallmar)
	-- Honor Hold itemIDs
	[27809] = {["n"] = "倒刺深绿橄榄石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},
	[28361] = {["n"] = "强大的血榴石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},
	[27820] = {["n"] = "锯型深绿橄榄石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},
	[27812] = {["n"] = "突出的血榴石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},

	--Thrallmar duplicates, different itemIDs
	--[27786] = {["n"] = "倒刺深绿橄榄石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},
	--[28360] = {["n"] = "强大的血榴石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},
	--[27785] = {["n"] = "锯型深绿橄榄石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},
	--[27777] = {["n"] = "突出的血榴石", 		["d"] = "商人, 10 荣誉堡印记/萨尔玛印记 (地狱火半岛)"},

	-- 商人 Purchased (Common Gems)
	[28458] = {["n"] = "清晰的红玉", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28462] = {["n"] = "明亮的红玉", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28466] = {["n"] = "闪亮的琥珀", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28459] = {["n"] = "精巧的红玉", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28469] = {["n"] = "闪烁的琥珀石", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28465] = {["n"] = "光亮的钻石", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28468] = {["n"] = "精密琥珀石", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28461] = {["n"] = "符文红玉", 			["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28467] = {["n"] = "光滑的琥珀石", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28463] = {["n"] = "坚固的钻石", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28464] = {["n"] = "闪亮钻石", 			["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28460] = {["n"] = "泪滴红玉", 			["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},
	[28470] = {["n"] = "厚重的琥珀石", 		["d"] = "宝石商, 2g (沙塔斯城, 风暴尖塔, 荣誉堡, 萨尔玛)"},

	-- Instance Epic Gem Drops
	[30565] = {["n"] = "刺客的火白石",		["d"] = "能源舰 - 英雄"},
	[30601] = {["n"] = "折光火白石",		["d"] = "鲜血熔炉 - 英雄"},
	[30574] = {["n"] = "蛮力紫萤石",		["d"] = "生态船 - 英雄"},
	[30587] = {["n"] = "勇士的火白石", 		["d"] = "奥金尼地穴 - 英雄"},
	[30566] = {["n"] = "防御者的紫萤石",		["d"] = "能源舰 - 英雄"},
	[30594] = {["n"] = "耀目玉髓",			["d"] = "地狱火城墙 - 英雄"},
	[30584] = {["n"] = "刻文火白石",		["d"] = "法力陵墓 - 英雄"},
	[30559] = {["n"] = "蚀刻火白石", 		["d"] = "暗影迷宫 - 英雄"},
	[30600] = {["n"] = "幽光紫萤石", 		["d"] = "鲜血熔炉 - 英雄"},
	[30558] = {["n"] = "黯光火白石",		["d"] = "黑色沼泽 - 英雄"},
	[30556] = {["n"] = "反光火白石",		["d"] = "黑色沼泽 - 英雄"},
	[30585] = {["n"] = "烁光火白石",		["d"] = "法力陵墓 - 英雄"},
	[30555]	= {["n"] = "炽热紫萤石",		["d"] = "黑色沼泽 - 英雄"},
	[31116] = {["n"] = "充能紫水晶",		["d"] = "任务奖励 - 夜祸, 卡拉赞"},
	[30551] = {["n"] = "充能火白石",		["d"] = "蒸汽地窟 - 英雄"},
	[30593] = {["n"] = "虹光火白石",		["d"] = "地狱火城墙 - 英雄"},
	[30602] = {["n"] = "裂纹玉髓",			["d"] = "鲜血熔炉 - 英雄"},
	[30606] = {["n"] = "烁光玉髓",			["d"] = "幽暗沼泽 - 英雄"},
	[30547] = {["n"] = "辉光火白石",		["d"] = "破碎大厅 - 英雄"},
	[30548] = {["n"] = "无瑕玉髓",			["d"] = "破碎大厅 - 英雄"},
	[30553] = {["n"] = "原始火白石",		["d"] = "塞泰克大厅 - 英雄"},
	[31118] = {["n"] = "脉动紫水晶",		["d"] = "任务奖励 - 夜祸, 卡拉赞"},
	[30608] = {["n"] = "辐光玉髓",			["d"] = "幽暗沼泽 - 英雄"},
	[30563]	= {["n"] = "华丽紫萤石",		["d"] = "暗影迷宫 - 英雄"},
	[30604] = {["n"] = "灿烂火白石",		["d"] = "奴隶围栏 - 英雄"},
	[30603]	= {["n"] = "皇家紫萤石",		["d"] = "奴隶围栏 - 英雄"},
	[30586] = {["n"] = "先知的玉髓",		["d"] = "奥金尼地穴 - 英雄"},
	[30549] = {["n"] = "狡诈紫萤石",		["d"] = "蒸汽地窟 - 英雄"},
	[30564] = {["n"] = "辉煌火白石",		["d"] = "能源舰 - 英雄"},
	[31117] = {["n"] = "抚慰紫水晶",		["d"] = "任务奖励 - 夜祸, 卡拉赞"},
	[30546] = {["n"] = "统御紫萤石",		["d"] = "破碎大厅 - 英雄"},
	[30607] = {["n"] = "华丽火白石",		["d"] = "幽暗沼泽 - 英雄"},
	[30554] = {["n"] = "坚韧火白石", 		["d"] = "塞泰克大厅 - 英雄"},
	[30592] = {["n"] = "稳固玉髓",			["d"] = "地狱火城墙 - 英雄"},
	[30550] = {["n"] = "碎裂玉髓",			["d"] = "蒸汽地窟 - 英雄"},
	[30583] = {["n"] = "永恒玉髓", 			["d"] = "法力陵墓 - 英雄"},
	[30605] = {["n"] = "鲜艳玉髓", 			["d"] = "奴隶围栏 - 英雄"},

	-- Added in Gem Helper v1.1
	[30552] = {["n"] = "神圣紫萤石",		["d"] = "塞泰克大厅 - 英雄"},
	[30589] = {["n"] = "眩光玉髓",			["d"] = "敦霍尔德 - 英雄"},
	[30582] = {["n"] = "致命火白石",		["d"] = "禁魔监狱 - 英雄"},
	[30581] = {["n"] = "耐久火白石",		["d"] = "禁魔监狱 - 英雄"},
	[30591] = {["n"] = "增效火白石",		["d"] = "敦霍尔德 - 英雄"},
	[30590] = {["n"] = "坚硬玉髓",			["d"] = "敦霍尔德 - 英雄"},
	[30572] = {["n"] = "帝王紫萤石",		["d"] = "生态船 - 英雄"},
	[30573] = {["n"] = "神秘火白石",		["d"] = "生态船 - 英雄"},
	[30575] = {["n"] = "轻盈火白石",		["d"] = "禁魔监狱 - 英雄"},
	[30588] = {["n"] = "高能火白石",		["d"] = "奥金尼地穴 - 英雄"},
	[30560] = {["n"] = "符文雕饰玉髓",		["d"] = "暗影迷宫 - 英雄"},

	-- Added in Gem Helper v1.2
	[31863] = {["n"] = "平衡夜目石",		["d"] = "需要 1 夜目石"},
	[31861] = {["n"] = "巨型黎明石",		["d"] = "需要 1 黎明石"},
	[31865] = {["n"] = "充能夜目石",		["d"] = "需要 1 夜目石"},
	[31867] = {["n"] = "隐秘黄晶玉",		["d"] = "需要 1 黄晶玉"},
	[31868] = {["n"] = "邪恶黄晶玉",		["d"] = "需要 1 黄晶玉"},
	[32836] = {["n"] = "纯净暗影珍珠",		["d"] = "需要 1 暗影珍珠, 1 清洁的德拉诺之水"},
	[32833] = {["n"] = "纯净裂纹珍珠",		["d"] = "需要 1 裂纹的珍珠, 1 清洁的德拉诺之水"},
	[32409]	= {["n"] = "残酷之大地风暴钻石",	["d"] = "需要 1 大地风暴钻石"},
	[32410] = {["n"] = "雷鸣之天火钻石",		["d"] = "需要 1 天火钻石"},

	-- Added in Gem Helper v1.3
	[24053] = {["n"] = "秘法黎明石",		["d"] = "需要 1 黎明石"},
	[32634] = {["n"] = "不稳定的紫水晶",		["d"] = "商人, 40 埃匹希斯碎片 (刀锋山)"},
	[32635] = {["n"] = "不稳定的翠榄石",		["d"] = "商人, 40 埃匹希斯碎片 (刀锋山)"},
	[32636] = {["n"] = "不稳定的蓝宝石",		["d"] = "商人, 40 埃匹希斯碎片 (刀锋山)"},
	[32637] = {["n"] = "不稳定的Citrine",		["d"] = "商人, 40 埃匹希斯碎片 (刀锋山)"},
	[32638] = {["n"] = "不稳定的Topaz",		["d"] = "商人, 40 埃匹希斯碎片 (刀锋山)"},
	[32639] = {["n"] = "不稳定的Talasite",		["d"] = "商人, 40 埃匹希斯碎片 (刀锋山)"},
	[32640] = {["n"] = "Potent 不稳定的Diamond",	["d"] = "商人, 160 埃匹希斯碎片 (刀锋山)"},
	[32641] = {["n"] = "Imbued 不稳定的Diamond",	["d"] = "商人, 160 埃匹希斯碎片 (刀锋山)"},

	-- Added in Gem Helper v1.3
	-- The following gems are crafted from epic gem drops in Black Temple/Hyjal
	[32193] = {["n"] = "朴素赤尖石",		["d"] = "需要 1 赤尖石"},
	[32194] = {["n"] = "精致赤尖石",		["d"] = "需要 1 赤尖石"},
	[32195] = {["n"] = "泪珠赤尖石",		["d"] = "需要 1 赤尖石"},
	[32196] = {["n"] = "符文赤尖石",		["d"] = "需要 1 赤尖石"},
	[32197] = {["n"] = "明亮赤尖石",		["d"] = "需要 1 赤尖石"},
	[32198] = {["n"] = "诡秘赤尖石",		["d"] = "需要 1 赤尖石"},
	[32199] = {["n"] = "闪光赤尖石",		["d"] = "需要 1 赤尖石"},
	[32200] = {["n"] = "致密天蓝宝石",		["d"] = "需要 1 天蓝宝石"},
	[32201] = {["n"] = "火花天蓝宝石",		["d"] = "需要 1 天蓝宝石"},
	[32202] = {["n"] = "异彩天蓝宝石",		["d"] = "需要 1 天蓝宝石"},
	[32203] = {["n"] = "风暴天蓝宝石",		["d"] = "需要 1 天蓝宝石"},
	[32204] = {["n"] = "闪耀狮眼石",		["d"] = "需要 1 狮眼石"},
	[32205] = {["n"] = "圆润狮眼石",		["d"] = "需要 1 狮眼石"},
	[32206] = {["n"] = "刚硬狮眼石",		["d"] = "需要 1 狮眼石"},
	[32207] = {["n"] = "柔光狮眼石",		["d"] = "需要 1 狮眼石"},
	[32208] = {["n"] = "厚重狮眼石",		["d"] = "需要 1 狮眼石"},
	[32209] = {["n"] = "秘法狮眼石",		["d"] = "需要 1 狮眼石"},
	[32210] = {["n"] = "巨型狮眼石",		["d"] = "需要 1 狮眼石"},
	[32211] = {["n"] = "统御影歌紫玉",		["d"] = "需要 1 影歌紫玉"},
	[32212] = {["n"] = "狡诈影歌紫玉",		["d"] = "需要 1 影歌紫玉"},
	[32213] = {["n"] = "平衡影歌紫玉",		["d"] = "需要 1 影歌紫玉"},
	[32214] = {["n"] = "充能影歌紫玉",		["d"] = "需要 1 影歌紫玉"},
	[32215] = {["n"] = "炽热影歌紫玉",		["d"] = "需要 1 影歌紫玉"},
	[32216] = {["n"] = "皇家影歌紫玉",		["d"] = "需要 1 影歌紫玉"},
	[32217] = {["n"] = "铭文焚石",			["d"] = "需要 1 焚石"},
	[32218] = {["n"] = "高能焚石",			["d"] = "需要 1 焚石"},
	[32219] = {["n"] = "辉光焚石",			["d"] = "需要 1 焚石"},
	[32220] = {["n"] = "反光焚石",			["d"] = "需要 1 焚石"},
	[32221] = {["n"] = "隐秘焚石",			["d"] = "需要 1 焚石"},
	[32222] = {["n"] = "邪恶焚石",			["d"] = "需要 1 焚石"},
	[32223] = {["n"] = "坚硬海浪翡翠",		["d"] = "需要 1 海浪翡翠"},
	[32224] = {["n"] = "辐光海浪翡翠",		["d"] = "需要 1 海浪翡翠"},
	[32225] = {["n"] = "眩光海浪翡翠",		["d"] = "需要 1 海浪翡翠"},
	[32226] = {["n"] = "裂纹海浪翡翠",		["d"] = "需要 1 海浪翡翠"},

	-- Added in Gem Helper v1.4 (patch 2.2.0)
	[33131] = {["n"] = "血色残阳",			["d"] = "需要 1 红曜石"},
	[33133] = {["n"] = "胡里奥之心",		["d"] = "需要 1 红曜石"},
	[33134] = {["n"] = "凯蕾的玫瑰",		["d"] = "需要 1 红曜石"},
	[33135] = {["n"] = "坠星石",			["d"] = "需要 1 艾露恩之星"},
	[33140] = {["n"] = "琥珀之血",			["d"] = "需要 1 黎明石"},
	[33143] = {["n"] = "刀锋之石",			["d"] = "需要 1 黎明石"},
	[33144] = {["n"] = "永恒之钻",			["d"] = "需要 1 黎明石"},
	[33782] = {["n"] = "稳固水玉",			["d"] = "需要 1 水玉"},

	-- Added in Gem Helper v1.41 (patch 2.2.2)
	[31862] = {["n"] = "平衡德拉诺影钻",		["d"] = "需要 1 德拉诺影钻"},
	[31860] = {["n"] = "巨型德拉诺金钻",		["d"] = "需要 1 德拉诺金钻"},
	[31864] = {["n"] = "充能德拉诺影钻",		["d"] = "需要 1 德拉诺影钻"},
	[31866] = {["n"] = "隐秘火榴石",		["d"] = "需要 1 火榴石"},
	[31869] = {["n"] = "邪恶火榴石",		["d"] = "需要 1 火榴石"},

	-- Added in Gem Helper v1.5 (patch 2.3.0)
	[34220] = {["n"] = "Chaotic Skyfire Diamond",	["d"] = "需要 1 天火钻石"},
	[34256] = {["n"] = "Charmed Amani Jewel",	["d"] = "任务奖励 - 祖阿曼"},
};

end