-------------------------------------------------------------------------------------------------------
-- Localizable strings (Traditional Chinese) 竹笙姬@暴風祭壇 http://tw.myblog.yahoo.com/norova.tw/
-- Lastupdate: 2008.04.02 by wangmarsfa@cwdg
if (GetLocale() == "zhTW") then

GEMHELPER_VERSION_TEXT		= "寶石助手 v1.7"
GEMHELPER_DONE_TEXT		= "完成"

GEMHELPER_ERRORTOOLTIP_L1	= "不安全的連結"
GEMHELPER_ERRORTOOLTIP_L2	= "ItemID: "
GEMHELPER_ERRORTOOLTIP_L3	= "這個物品連結並不安全. 為了避免發生與伺服器中斷連結, 你需要曾經在遊戲中看過這項物品. 這是暴雪公司自從1.10版本後所加入的限制."
GEMHELPER_ERRORTOOLTIP_L4	= "你可以在不安全的連結上使用滑鼠右鍵, 向伺服器要求查看物品. 你可能與伺服器中斷連結!!"
GEMHELPER_QUERY_MESSAGE		= "伺服器搜尋物品:  "

GEMHELPER_OPENJC_TEXT		= "打開/關閉 預設珠寶設計技能視窗."
GEMHELPER_CHANGEBGCOLOR_TEXT	= "變更背景顏色."

-- GEMHELPER_JEWELCRAFTING_TEXT must match the text written on the top of default Jewelcrafting UI
-- window, which should also be the same as the text written in your Character --> Skills -->
-- Professions panel because this string is used to check whether a player has Jewelcrafting as
-- a profession as well as whether the Jewelcrafting default UI window is about to be open.
GEMHELPER_JEWELCRAFTING_TEXT	= "珠寶設計"

GEMHELPER_CHECKBUTTON_TEXT	= {
	[1]	= "用顏色過濾",
	[2]	= "用材料過濾",
	[3]	= "用數據過濾",

	[11]	= "藍色",
	[12]	= "紅色",
	[13]	= "黃色",
	[14]	= "變換",

	[21]	= "藍月石 (藍)",
	[22]	= "血石榴石 (紅)",
	[23]	= "黃金卓奈石 (黃)",
	[24]	= "翠綠橄欖石 (黃/藍)",
	[25]	= "火石榴石 (黃/紅)",
	[26]	= "暗影卓奈石 (紅/藍)",
	[27]	= "鋸齒珍珠 (紅/藍)",

	[31]	= "伊露恩之星 (藍)",
	[32]	= "生命紅寶石 (紅)",
	[33]	= "黎明石 (黃)",
	[34]	= "泰拉寶石 (黃/藍)",
	[35]	= "皇家黃寶石 (黃/紅)",
	[36]	= "夜眼石 (紅/藍)",
	[37]	= "暗影珍珠 (紅/藍)",

	[41]	= "天火鑽石 (變換)",
	[42]	= "大地風暴鑽石 (變換)",

	[51]	= "蒼穹藍寶石 (藍)",
	[52]	= "赤紅尖晶石 (紅)",
	[53]	= "獅眼石 (黃)",
	[54]	= "海泉綠寶石 (黃/藍)",
	[55]	= "焚石 (黃/紅)",
	[56]	= "影歌紫水晶 (紅/藍)",

	[61]	= "力量",
	[62]	= "敏捷",
	[63]	= "耐力",
	[64]	= "智力",
	[65]	= "精神",
	[66]	= "韌性",

	[70]	= "法術加速等級",
	[71]	= "命中等級",
	[72]	= "致命一擊等級",
	[73]	= "攻擊強度",
	[74]	= "閃躲等級",
	[75]	= "防禦等級",
	[76]	= "招架等級",

	[80]	= "法術命中等級",
	[81]	= "法術致命一擊等級",
	[82]	= "法術穿透力",
	[83]	= "法術傷害",
	[84]	= "治療",
	[85]	= "5秒回魔",
	[86]	= "全部抗性",

	[101]	= "顯示珠寶設計的寶石",
	[1011]	= "顯示身上已有材料的",
	[1012]	= "可切割的角色: %s ",
	[102]	= "顯示附魔的寶石",
	[103]	= "顯示商人販售的寶石",
	[104]	= "顯示副本掉落的寶石",

	[111]	= "取代預設的系統介面",
}

-- Data for English localization
GemHelper_GemLocaleData = {
	-- Crafted Uncommon Quality Gems
	[23095] = {["n"] = "清晰的血石榴石",		["d"] = "需要 1 血石榴石"},
	[28595] = {["n"] = "明亮的血石榴石",		["d"] = "需要 1 血石榴石"},
	[23113] = {["n"] = "明亮的黃金卓奈石",		["d"] = "需要 1 黃金卓奈石"},
	[23106] = {["n"] = "燦爛的翠綠橄欖石",		["d"] = "需要 1 翠綠橄欖石 (占卜者)"},
	[23097] = {["n"] = "精美的血石榴石",		["d"] = "需要 1 血石榴石"},
	[23105] = {["n"] = "耐久的翠綠橄欖石",		["d"] = "需要 1 翠綠橄欖石"},
	[23114] = {["n"] = "微光的黃金卓奈石",		["d"] = "需要 1 黃金卓奈石"},
	[23100] = {["n"] = "閃爍的火石榴石",		["d"] = "需要 1 火石榴石"},
	[23108] = {["n"] = "發光的暗影卓奈石",		["d"] = "需要 1 暗影卓奈石"},
	[23098] = {["n"] = "雕刻過的火石榴石",		["d"] = "需要 1 火石榴石"},
	[23104] = {["n"] = "鋸齒狀的翠綠橄欖石",	["d"] = "需要 1 翠綠橄欖石"},
	[23099] = {["n"] = "夜光的火石榴石",		["d"] = "需要 1 火石榴石"},
	[23121] = {["n"] = "光亮的藍月石",		["d"] = "需要 1 藍月石"},
	[23101] = {["n"] = "高效的火石榴石",		["d"] = "需要 1 火石榴石"},
	[23103] = {["n"] = "發光的翠綠橄欖石",		["d"] = "需要 1 翠綠橄欖石"},
	[23116] = {["n"] = "堅硬的黃金卓奈石",		["d"] = "需要 1 黃金卓奈石"},
	[23109] = {["n"] = "高貴的暗影卓奈石",		["d"] = "需要 1 暗影卓奈石 (奧多爾)"},
	[23096] = {["n"] = "符文血石榴石",		["d"] = "需要 1 血石榴石"},
	[23110] = {["n"] = "移形的暗影卓奈石",		["d"] = "需要 1 暗影卓奈石"},
	[28290] = {["n"] = "光滑的黃金卓奈石",		["d"] = "需要 1 黃金卓奈石"},
	[23118] = {["n"] = "堅固的藍月石",		["d"] = "需要 1 藍月石"},
	[23111] = {["n"] = "高級的暗影卓奈石",		["d"] = "需要 1 暗影卓奈石"},
	[23119] = {["n"] = "閃亮的藍月石",		["d"] = "需要 1 藍月石"},
	[23120] = {["n"] = "激烈的藍月石",		["d"] = "需要 1 藍月石"},
	[23094] = {["n"] = "淚滴血石榴石",		["d"] = "需要 1 血石榴石"},
	[23115] = {["n"] = "厚重的黃金卓奈石",		["d"] = "需要 1 黃金卓奈石"},

	-- Crafted Rare Quality Gems
	[24027] = {["n"] = "清晰的生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24031] = {["n"] = "光亮的生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24047] = {["n"] = "明亮的黎明石",		["d"] = "需要 1 黎明石"},
	[24065] = {["n"] = "燦爛的泰拉寶石",		["d"] = "需要 1 泰拉寶石"},
	[24028] = {["n"] = "精緻的生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24062] = {["n"] = "堅固的泰拉寶石",		["d"] = "需要 1 泰拉寶石"},
	[24036] = {["n"] = "閃爍的生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24050] = {["n"] = "微光的黎明石",		["d"] = "需要 1 黎明石"},
	[24061] = {["n"] = "閃爍的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[24056] = {["n"] = "發光的夜眼石",		["d"] = "需要 1 夜眼石"},
	[24058] = {["n"] = "雕刻的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[24067] = {["n"] = "堅固的泰拉寶石",		["d"] = "需要 1 泰拉寶石"},
	[24060] = {["n"] = "夜光的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[24037] = {["n"] = "光輝的伊露恩之星",		["d"] = "需要 1 伊露恩之星"},
	[24059] = {["n"] = "高效的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[24066] = {["n"] = "明亮的泰拉寶石",		["d"] = "需要 1 泰拉寶石"},
	[24051] = {["n"] = "堅硬的黎明石",		["d"] = "需要 1 黎明石"},
	[24057] = {["n"] = "高貴的夜眼石",		["d"] = "需要 1 夜眼石"},
	[24030] = {["n"] = "符文生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24055] = {["n"] = "移形的夜眼石",		["d"] = "需要 1 夜眼石"},
	[24048] = {["n"] = "平滑的黎明石",		["d"] = "需要 1 黎明石"},
	[24033] = {["n"] = "堅固的伊露恩之星",		["d"] = "需要 1 伊露恩之星"},
	[24054] = {["n"] = "尊貴的夜眼石",		["d"] = "需要 1 夜眼石"},
	[24035] = {["n"] = "閃亮的伊露恩之星",		["d"] = "需要 1 伊露恩之星"},
	[24039] = {["n"] = "風暴的伊露恩之星",		["d"] = "需要 1 伊露恩之星"},
	[24032] = {["n"] = "精良的生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24029] = {["n"] = "淚滴生命紅寶石",		["d"] = "需要 1 生命紅寶石"},
	[24052] = {["n"] = "厚重的黎明石",		["d"] = "需要 1 黎明石"},

	-- Crafted Rare Meta Gems
	[25897] = {["n"] = "振奮的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},
	[25899]	= {["n"] = "粗暴的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},
	[25890] = {["n"] = "毀滅的天火鑽石",		["d"] = "需要 1 天火鑽石"},
	[25895] = {["n"] = "謎般的天火鑽石",		["d"] = "需要 1 天火鑽石"},
	[25901]	= {["n"] = "洞察的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},
	[25893] = {["n"] = "神秘的天火鑽石",		["d"] = "需要 1 天火鑽石"},
	[25896] = {["n"] = "強力的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},
	[25894] = {["n"] = "迅捷的天火鑽石",		["d"] = "需要 1 天火鑽石"},
	[25898]	= {["n"] = "堅韌的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},

	-- Enchanter Created
	[22460] = {["n"] = "稜石之球",			["d"] = "附魔師, 需要 4 大塊稜石碎片"},
	[22459] = {["n"] = "虛無之球",			["d"] = "附魔師, 需要 2 虛無水晶"},

	-- PvP Purchased Rare Meta Gems (Terrokar Spirit Towers)
	[28557] = {["n"] = "迅捷星火鑽石",		["d"] = "商人, 8 鬼靈碎片 (艾蘭里堡壘/碎石堡)"},
	[28556] = {["n"] = "迅捷風火鑽石",		["d"] = "商人, 8 鬼靈碎片 (艾蘭里堡壘/碎石堡)"},

	-- PvP Purchased Gems (Nagrand, Halaa)
	[27679]	= {["n"] = "華麗的神秘黎明石",		["d"] = "商人, 100 哈剌戰鬥徽章 (哈喇, 納葛蘭)"},
	[30598] = {["n"] = "阿曼席歐先生的心形寶石",	["d"] = "商人, 14g 9s 72c (限量) (哈喇, 納葛蘭)"},

	-- PvP Purchased Epic Gems (Honor Points)
	[28362] = {["n"] = "清晰的華麗紅寶石",		["d"] = "商人, 8100 榮譽 (勇士大廳/傳說大廳)"},
	[28120] = {["n"] = "華麗的微光黎明石",		["d"] = "商人, 8100 榮譽 (勇士大廳/傳說大廳)"},
	[28363] = {["n"] = "雕刻的華麗黃寶石",		["d"] = "商人, 10000 榮譽 (勇士大廳/傳說大廳)"},
	[28123] = {["n"] = "高效的華麗黃寶石",		["d"] = "商人, 10000 榮譽 (勇士大廳/傳說大廳)"},
	[28118] = {["n"] = "符文華麗紅寶石",		["d"] = "商人, 8100 榮譽 (勇士大廳/傳說大廳)"},
	[28119] = {["n"] = "華麗的平滑黎明石",		["d"] = "商人, 8100 榮譽 (勇士大廳/傳說大廳)"},

	-- PvP Puchased Rare Gems (Honor Hold/Thrallmar)
	-- Honor Hold itemIDs
	[27809] = {["n"] = "倒刺深綠橄欖石", 		["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},
	[28361] = {["n"] = "強大的血石榴石", 		["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},
	[27820] = {["n"] = "鋸型深綠橄欖石", 		["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},
	[27812] = {["n"] = "突出的血石榴石", 		["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},

	--Thrallmar duplicates, different itemIDs
	--[27786] = {["n"] = "倒刺深綠橄欖石",	 	["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},
	--[28360] = {["n"] = "強大的血石榴石",	 	["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},
	--[27785] = {["n"] = "鋸型深綠橄欖石", 		["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},
	--[27777] = {["n"] = "突出的血石榴石", 		["d"] = "商人, 10 榮譽堡印記/索爾瑪印記 (地獄火半島)"},

	-- 商人 Purchased (Common Gems)
	[28458] = {["n"] = "清晰的紅玉", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28462] = {["n"] = "明亮的紅玉", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28466] = {["n"] = "閃亮的琥珀", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28459] = {["n"] = "精巧的紅玉", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28469] = {["n"] = "閃爍的琥珀石", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28465] = {["n"] = "光亮的鑽石", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28468] = {["n"] = "精密琥珀石", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28461] = {["n"] = "符文紅玉", 			["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28467] = {["n"] = "光滑的琥珀石", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28463] = {["n"] = "堅固的鑽石", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28464] = {["n"] = "閃亮鑽石", 			["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28460] = {["n"] = "淚滴紅玉",			["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},
	[28470] = {["n"] = "厚重的琥珀石", 		["d"] = "寶石商, 2g (撒塔斯城, 風暴之尖, 榮譽堡, 索爾瑪)"},

	-- Instance Epic Gem Drops
	[30565] = {["n"] = "刺客的火焰蛋白石",		["d"] = "麥克那爾 - 英雄"},
	[30601] = {["n"] = "發光的火焰蛋白石",		["d"] = "血熔爐 - 英雄"},
	[30574] = {["n"] = "野獸丹泉石",		["d"] = "波塔尼卡 - 英雄"},
	[30587] = {["n"] = "勇士的火焰蛋白石", 		["d"] = "奧奇奈地穴 - 英雄"},
	[30566] = {["n"] = "防禦者的丹泉石",		["d"] = "麥克那爾 - 英雄"},
	[30594] = {["n"] = "光輝的綠玉髓",		["d"] = "地獄火壁壘 - 英雄"},
	[30584] = {["n"] = "刻劃火焰蛋白石",		["d"] = "法力墓地 - 英雄"},
	[30559] = {["n"] = "蝕刻火焰蛋白石", 		["d"] = "暗影迷宮 - 英雄"},
	[30600] = {["n"] = "螢光丹泉石",		["d"] = "血熔爐 - 英雄"},
	[30558] = {["n"] = "閃光火焰蛋白石",		["d"] = "黑色沼澤 - 英雄"},
	[30556] = {["n"] = "閃爍的火焰蛋白石",		["d"] = "黑色沼澤 - 英雄"},
	[30585] = {["n"] = "閃亮亮的火焰蛋白石",	["d"] = "法力墓地 - 英雄"},
	[30555]	= {["n"] = "發光的丹泉石",		["d"] = "黑色沼澤 - 英雄"},
	[31116] = {["n"] = "注入能量的紫水晶",		["d"] = "任務獎勵 - 夜禍, 卡拉贊"},
	[30551] = {["n"] = "注入能量的火焰蛋白石",	["d"] = "蒸汽洞窟 - 英雄"},
	[30593] = {["n"] = "彩虹火焰蛋白石",		["d"] = "地獄火壁壘 - 英雄"},
	[30602] = {["n"] = "鋸齒綠玉髓",		["d"] = "血熔爐 - 英雄"},
	[30606] = {["n"] = "柔光綠玉髓",		["d"] = "毒牙沼澤 - 英雄"},
	[30547] = {["n"] = "夜光火蛋白石",		["d"] = "破碎大廳 - 英雄"},
	[30548] = {["n"] = "拋光的綠玉髓",		["d"] = "破碎大廳 - 英雄"},
	[30553] = {["n"] = "原始火焰蛋白石",		["d"] = "塞司克大廳 - 英雄"},
	[31118] = {["n"] = "波光紫水晶",		["d"] = "任務獎勵 - 夜禍, 卡拉贊"},
	[30608] = {["n"] = "輻光綠玉髓",		["d"] = "毒牙沼澤 - 英雄"},
	[30563]	= {["n"] = "華麗丹泉石",		["d"] = "暗影迷宮 - 英雄"},
	[30604] = {["n"] = "光輝火焰蛋白石",		["d"] = "奴隸監獄 - 英雄"},
	[30603]	= {["n"] = "皇家丹泉石",		["d"] = "奴隸監獄 - 英雄"},
	[30586] = {["n"] = "先知綠玉髓",		["d"] = "奧奇奈地穴 - 英雄"},
	[30549] = {["n"] = "變形的丹泉石",		["d"] = "蒸汽洞窟 - 英雄"},
	[30564] = {["n"] = "閃亮火焰蛋白石",		["d"] = "麥克那爾 - 英雄"},
	[31117] = {["n"] = "舒心紫水晶",		["d"] = "任務獎勵 - 夜禍, 卡拉贊"},
	[30546] = {["n"] = "高貴丹泉石",		["d"] = "破碎大廳 - 英雄"},
	[30607] = {["n"] = "絢麗火焰蛋白石",		["d"] = "毒牙沼澤 - 英雄"},
	[30554] = {["n"] = "堅定火焰蛋白石", 		["d"] = "塞司克大廳 - 英雄"},
	[30592] = {["n"] = "堅硬的綠玉髓",		["d"] = "地獄火壁壘 - 英雄"},
	[30550] = {["n"] = "碎裂綠玉髓",		["d"] = "蒸汽洞窟 - 英雄"},
	[30583] = {["n"] = "永恆綠玉髓", 		["d"] = "法力墓地 - 英雄"},
	[30605] = {["n"] = "鮮艷的綠玉髓", 		["d"] = "奴隸監獄 - 英雄"},

	-- Added in Gem Helper v1.1
	[30552] = {["n"] = "神聖丹泉石",		["d"] = "塞司克大廳 - 英雄"},
	[30589] = {["n"] = "燦爛的綠玉髓",		["d"] = "希爾斯布萊德丘陵舊址 - 英雄"},
	[30582] = {["n"] = "致命的火焰蛋白石",		["d"] = "亞克崔茲 - 英雄"},
	[30581] = {["n"] = "持久火焰蛋白石",		["d"] = "亞克崔茲 - 英雄"},
	[30591] = {["n"] = "強能火焰蛋白石",		["d"] = "希爾斯布萊德丘陵舊址 - 英雄"},
	[30590] = {["n"] = "耐久綠玉髓",		["d"] = "希爾斯布萊德丘陵舊址 - 英雄"},
	[30572] = {["n"] = "帝國丹泉石",		["d"] = "波塔尼卡 - 英雄"},
	[30573] = {["n"] = "神秘火焰蛋白石",		["d"] = "波塔尼卡 - 英雄"},
	[30575] = {["n"] = "靈巧火焰蛋白石",		["d"] = "亞克崔茲 - 英雄"},
	[30588] = {["n"] = "強效火焰蛋白石",		["d"] = "奧奇奈地穴 - 英雄"},
	[30560] = {["n"] = "符文表面的綠玉髓",		["d"] = "暗影迷宮 - 英雄"},

	-- Added in Gem Helper v1.2
	[31863] = {["n"] = "平衡的夜眼石",		["d"] = "需要 1 夜眼石"},
	[31861] = {["n"] = "絕佳的黎明石",		["d"] = "需要 1 黎明石"},
	[31865] = {["n"] = "注入力量的夜眼石",		["d"] = "需要 1 夜眼石"},
	[31867] = {["n"] = "矇矓的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[31868] = {["n"] = "邪惡的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[32836] = {["n"] = "純淨的暗影珍珠",		["d"] = "需要 1 暗影珍珠, 1 淨化過的德萊尼水"},
	[32833] = {["n"] = "純淨的鋸齒珍珠",		["d"] = "需要 1 鋸齒珍珠, 1 淨化過的德萊尼水"},
	[32409]	= {["n"] = "堅韌的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},
	[32410] = {["n"] = "驚人的天火鑽石",		["d"] = "需要 1 天火鑽石"},

	-- Added in Gem Helper v1.3
	[24053] = {["n"] = "神秘的黎明石",		["d"] = "需要, 1 黎明石"},
	[32634] = {["n"] = "不穩定的紫水晶",		["d"] = "商人, 40 頂尖碎片 (劍刃山脈)"},
	[32635] = {["n"] = "不穩定的翠綠橄欖石",	["d"] = "商人, 40 頂尖碎片 (劍刃山脈)"},
	[32636] = {["n"] = "不穩定的藍寶石",		["d"] = "商人, 40 頂尖碎片 (劍刃山脈)"},
	[32637] = {["n"] = "不穩定的黃水晶",		["d"] = "商人, 40 頂尖碎片 (劍刃山脈)"},
	[32638] = {["n"] = "不穩定的黃寶石",		["d"] = "商人, 40 頂尖碎片 (劍刃山脈)"},
	[32639] = {["n"] = "不穩定的泰拉寶石",		["d"] = "商人, 40 頂尖碎片 (劍刃山脈)"},
	[32640] = {["n"] = "高效的不穩定鑽石",		["d"] = "商人, 160 頂尖碎片 (劍刃山脈)"},
	[32641] = {["n"] = "灌魔的不穩定鑽石",		["d"] = "商人, 160 頂尖碎片 (劍刃山脈)"},

	-- Added in Gem Helper v1.3
	-- The following gems are crafted from epic gem drops in Black Temple/Hyjal
	[32193] = {["n"] = "清晰的赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32194] = {["n"] = "精緻的赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32195] = {["n"] = "淚滴赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32196] = {["n"] = "符文赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32197] = {["n"] = "明亮的赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32198] = {["n"] = "精巧的赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32199] = {["n"] = "閃亮的赤紅尖晶石",		["d"] = "需要, 1 赤紅尖晶石"},
	[32200] = {["n"] = "堅固的蒼穹藍寶石",		["d"] = "需要, 1 蒼穹藍寶石"},
	[32201] = {["n"] = "發光的蒼穹藍寶石",		["d"] = "需要, 1 蒼穹藍寶石"},
	[32202] = {["n"] = "光亮的蒼穹藍寶石",		["d"] = "需要, 1 蒼穹藍寶石"},
	[32203] = {["n"] = "狂暴的蒼穹藍寶石",		["d"] = "需要, 1 蒼穹藍寶石"},
	[32204] = {["n"] = "明亮的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32205] = {["n"] = "光滑的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32206] = {["n"] = "堅硬的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32207] = {["n"] = "閃爍的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32208] = {["n"] = "厚重的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32209] = {["n"] = "神秘的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32210] = {["n"] = "絕佳的獅眼石",		["d"] = "需要, 1 獅眼石"},
	[32211] = {["n"] = "至尊影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[32212] = {["n"] = "移形影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[32213] = {["n"] = "平衡影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[32214] = {["n"] = "能量影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[32215] = {["n"] = "鮮艷影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[32216] = {["n"] = "皇家影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[32217] = {["n"] = "雕刻焚石",			["d"] = "需要, 1 焚石"},
	[32218] = {["n"] = "高效焚石",			["d"] = "需要, 1 焚石"},
	[32219] = {["n"] = "光輝焚石",			["d"] = "需要, 1 焚石"},
	[32220] = {["n"] = "閃爍焚石",			["d"] = "需要, 1 焚石"},
	[32221] = {["n"] = "矇矓焚石",			["d"] = "需要, 1 焚石"},
	[32222] = {["n"] = "邪惡焚石",			["d"] = "需要, 1 焚石"},
	[32223] = {["n"] = "耐久的海泉綠寶石",		["d"] = "需要, 1 海泉綠寶石"},
	[32224] = {["n"] = "發光的海泉綠寶石",		["d"] = "需要, 1 海泉綠寶石"},
	[32225] = {["n"] = "燦爛的海泉綠寶石",		["d"] = "需要, 1 海泉綠寶石"},
	[32226] = {["n"] = "尖突的海泉綠寶石",		["d"] = "需要, 1 海泉綠寶石"},

	-- Added in Gem Helper v1.4
	[33131] = {["n"] = "赤紅之日",			["d"] = "需要 1 生命紅寶石"},
	[33133] = {["n"] = "胡力歐之心",		["d"] = "需要 1 生命紅寶石"},
	[33134] = {["n"] = "凱麗之薔",			["d"] = "需要 1 生命紅寶石"},
	[33135] = {["n"] = "殞落之星",			["d"] = "需要 1 伊露恩之星"},
	[33140] = {["n"] = "琥珀之血",			["d"] = "需要 1 黎明石"},
	[33143] = {["n"] = "眾刃之石",			["d"] = "需要 1 黎明石"},
	[33144] = {["n"] = "永恆切面",			["d"] = "需要 1 黎明石"},
	[33782] = {["n"] = "穩固的泰拉寶石",		["d"] = "需要 1 泰拉寶石"},

	-- Added in Gem Helper v1.41 (patch 2.2.2)
	[31862] = {["n"] = "平衡的暗影卓奈石",		["d"] = "需要 1 暗影卓奈石"},
	[31860] = {["n"] = "絕佳的黃金卓奈石",		["d"] = "需要 1 黃金卓奈石"},
	[31864] = {["n"] = "注入力量的暗影卓奈石",	["d"] = "需要 1 暗影卓奈石"},
	[31866] = {["n"] = "矇矓的火石榴石",		["d"] = "需要 1 火石榴石"},
	[31869] = {["n"] = "邪惡的火石榴石",		["d"] = "需要 1 火石榴石"},

	-- Added in Gem Helper v1.5 (patch 2.3.0)
	[34220] = {["n"] = "混沌的天火鑽石",		["d"] = "需要 1 天火鑽石"},
	[34256] = {["n"] = "魅惑的阿曼尼珠寶",		["d"] = "任務獎勵 - 祖阿曼"},

	-- Added in Gem Helper v1.6 (patch 2.4.0)
	[35503] = {["n"] = "餘燼的天火鑽石",		["d"] = "需要 1 天火鑽石"},
	[35501] = {["n"] = "永恆的大地風暴鑽石",	["d"] = "需要 1 大地風暴鑽石"},
	[35707] = {["n"] = "華貴的夜眼石",		["d"] = "需要 1 夜眼石"},
	[34831] = {["n"] = "海洋之眼",			["d"] = "任務獎勵 - 每日釣魚任務"},
	[35758] = {["n"] = "穩固的海泉綠寶石",		["d"] = "需要, 1 海泉綠寶石"},
	[35759] = {["n"] = "堅強的海泉綠寶石",		["d"] = "需要, 1 海泉綠寶石"},
	[35760] = {["n"] = "魯莽焚石",			["d"] = "需要, 1 焚石"},
	[35761] = {["n"] = "迅速的獅眼石",		["d"] = "需要, 1 獅眼石"},

	-- Added in Gem Helper v1.7 (patch 2.4.2)
	[37503] = {["n"] = "純淨的影歌紫水晶",		["d"] = "需要, 1 影歌紫水晶"},
	[35315] = {["n"] = "迅速的黎明石",		["d"] = "需要 1 黎明石"},
	[35316] = {["n"] = "魯莽的皇家黃寶石",		["d"] = "需要 1 皇家黃寶石"},
	[35318] = {["n"] = "堅強的泰拉寶石",		["d"] = "需要 1 泰拉寶石"},
}

end