-- [魔典：血契（等级 6）]

if( GetLocale() == "zhCN" ) then

	GK_TEXT_GRIMOIRE = "魔典";

	GK_TEXT_RANK = "等级";

	GK_ARTICLE_REGEX = "：";
	
	GK_GRIMOIRES = {
		["火焰箭"]		= { "火焰箭", false },
		["血之契印"]		= { "血之契印", false },
		["火焰之盾"]		= { "火焰之盾", false },
		["相位变换"]		= { "相位变换", false },
		["折磨"]		= { "折磨", false },
		["牺牲"]		= { "牺牲", false },
		["吞噬暗影"]		= { "吞噬暗影", false },
		["受难"]		= { "受难", false },
		["剧痛鞭笞"]		= { "剧痛鞭笞", false },
		["安抚之吻"]		= { "安抚之吻", false },
		["诱惑"]		= { "诱惑", false },
		["次级隐形术"]		= { "次级隐形术", false },
		["吞噬魔法"]		= { "吞噬魔法", false },
		["腐坏之血"]		= { "腐坏之血", false },
		["法术封锁"]		= { "法术封锁", false },
		["多疑"]		= { "多疑", false },
		["恶魔狂暴"]		= { "恶魔狂暴", true },
		["躲闪"]		= { "躲闪", true },
		["痛楚"]		= { "痛楚", true },
		["顺劈斩"]		= { "顺劈斩", true },
		["拦截"]		= { "拦截", true },
	}
end